Охотники_и_рыболовы/src/Catalogs/Дичь/Дичь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Дичь</name>
  <tabularSections>
    <name>ВидыДичи</name>
    <attributes>
      <name>ВидДичи</name>
      <type>
        <types>CatalogRef.ВидыДичи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Охотники_и_рыболовы/src/Catalogs/Дичь/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ЗаполнитьПоМакету()
	НачатьТранзакцию();
	Макет = Справочники.Дичь.ПолучитьМакет("Макет");
	Кол = 1;
	Стр = 1;
	
	Пока истина Цикл
			Адрес="R"+Формат(Стр,"ЧГ=")+"C" + Формат(Кол,"ЧГ=");
		    Значение=Макет.Область(Адрес).Текст;
		    Если ПустаяСтрока(Значение) Тогда
				
				Прервать;
		    КонецЕсли;      

		Пока истина Цикл
			Адрес="R"+Формат(Стр,"ЧГ=")+"C" + Формат(Кол,"ЧГ=");
		    Значение=Макет.Область(Адрес).Текст;
		    Если ПустаяСтрока(Значение) Тогда
				
				Прервать;
		    КонецЕсли;      
			
			Если кол = 1 Тогда
				ВидДичи = Справочники.ВидыДичи.НайтиПоНаименованию(Значение);
				кол = кол +1;
				Продолжить;
			Иначе	
				элемент = Справочники.Дичь.НайтиПоНаименованию(Значение);
				Если элемент.Пустая() Тогда
					Если значение = "Шакал" Тогда
						а=0;
					КонецЕсли;
					
					элемент = Справочники.Дичь.СоздатьЭлемент();
					элемент.Наименование = Значение;
				Иначе
					элемент = элемент.Ссылка.ПолучитьОбъект();
				КонецЕсли;	
					стртч = элемент.ВидыДичи.Добавить();
					стртч.ВидДичи = ВидДичи;
				
				Попытка
					элемент.Записать();	
				Исключение
			     	ОтменитьТранзакцию();
					Возврат;
				КонецПопытки;
			КонецЕсли;	
			Кол = Кол + 1;	
		КонецЦикла;
		Кол = 1;
		Стр = Стр + 1;
	КонецЦикла;  
	ЗафиксироватьТранзакцию();

КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕстьNull(ВидыДичи.Поле1,0) КАК КоличествоВидов,
		|	ЕстьNull(Дичь.Поле1,0) КАК КоличествоДичи
		|ИЗ
		|	(ВЫБРАТЬ
		|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВидыДичи.Ссылка) КАК Ссылка,
		|		СУММА(1) КАК Поле1
		|	ИЗ
		|		Справочник.ВидыДичи КАК ВидыДичи) КАК ВидыДичи,
		|	(ВЫБРАТЬ
		|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Дичь.Ссылка) КАК Ссылка,
		|		СУММА(1) КАК Поле1
		|	ИЗ
		|		Справочник.Дичь КАК Дичь) КАК Дичь";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат[0].КоличествоВидов = 0 Тогда
		ВидыПустые = Истина;	
	
		Отказ = Истина;
		ТекстСообщения = "Список видов дичи пуст. Создание невозможно";
		ОхотаСервер.ПоказатьСообщение(ТекстСообщения,"ЭтаФорма");
		//Возврат;
	КонецЕсли;
	Если Результат[0].КоличествоДичи = 0 Тогда
		Пустой = Истина;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОповещение() 
	
	ТекстВопроса = "Список пуст. Вы хотите заполнить автоматически?";
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтаФорма, Параметры);
	ПоказатьВопрос(Оповещение,ТекстВопроса , Режим, 0);

КонецПроцедуры


&НаКлиенте 
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	Иначе
		ЗаполнитьПоМакету();
		Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Пустой Тогда
		СоздатьОповещение();
	КонецЕсли;	
КонецПроцедуры
